let handler = m => m
handler.all = async function (m) {
let chat = global.db.data.chats[m.chat] 
     if (/^استماره$/i.test(m.text) ) { //sem prefixo
    conn.reply(m.chat, `أنرتي جميلتي النقابه܀⊹🌼🌻⊹܀
إدارة 𝐀𝐮𝐫𝐚  ↜♡↝܀⊹🌻
╔═✮❁•°🌻°•❁✮ ═╗
♡↜الـلـقـب〘〙
♡↜اسـم الإنـمـي〘〙
♡↜الجـنـس〘〙
♡↜مـن طـرف〘〙
╔═✮❁•°🌻°•❁✮ ═╗
*ارفـقـي صـورة مـع لـقبـك الـمـخـتـار*🌻❀
يـسـمـح بـأخـذ الـقـاب مـن 
الإنـمـي❁مانـغا❁
كـرتـون❁كـيـبـوب ❁بـوب ❁درامـا....🌻∼
‏  ֺ  ָ   ֙⋆ 🌻  ་    ᳝   ◝   💭  𖥻  
إدارة 𝐀𝐮𝐫𝐚↜♡↝܀🌻❀`, m) //wm, null, [['Menu', '#menu']], m) botones :V

}
    if (/^الترحيب$/i.test(m.text) ) { //sem prefixo
    conn.reply(m.chat, `𖠌 ⋅ ┈──━ ⊰ ᯽ ⊱ ━──┈ ⋅ 𖠌 
❥ اهـلاً وسهلاً بـك فـي ✨ 😘
‏𝐀𝐮𝐫𝐚 ↜♡↝܀⊹🌻❀

*◈ نـتـشـرف بـوجـود عضو *

‏❥߷ ┆@⁨⁩  ߷

❥ أشرقت الأنوار بقدومك وتدفق النهر في أطلالك وغردت الطيور بك فيا أهلاً ويا سهلاً بالقلب نبعثر التراحيب ونزف استقبالنا معطراً بالورد والكادي مملوء بالحب والشوق والمشاعر. نستقبلك بباقات من الأقحوان والياسمين✨🌻

‏𖠌 ⋅ ┈──━ ⊰ ❊ ⊱ ━──┈ ⋅ 𖠌`, m) //wm, null, [['Menu', '#menu']], m) botones :V

} 
    if (/^الاجراس$/i.test(m.text) ) { //sem prefixo
    conn.reply(m.chat, `𝐀𝐮𝐫𝐚 ↜♡↝܀⊹🌻❀

*➹――🌻―――🌻――➹

     ♧︎ 🛎️ الأجراس 🛎️ ♧︎

⌬┊شرح الفعالية 📜
• المُقدم يبدأ بـ تقديم صور أو كِتابة و أول مشارك يقوم بـ إرسال ايموجي الجرس (🛎️) يُسمح له بالإجابة. 

☜︎مدة الإجابة 15 ثانية إن لم تجيب على السؤال يتم إعتماد إجابة ثاني مرسل للجرس. 

☜︎ إذا قمت بإرسال ايموجي الجرس قبل السؤال يتم تجميدك عن الإجابة في السؤال القادم.

☯︎︎⋅‏ ── •﹝雲﹞• ── ⋅ ☯︎︎
✍︎︎ ┊ المُقَـدم 🎙️「」*
✍︎︎ ┊ عدد المشاركين 🔢「」*
✍︎︎ ┊ وقت الفعالية ⏱️「」*

➹――🌻―――🌻――➹

    ⌬┆إدارة • ✨🌻┆⌬*

‏𝐀𝐮𝐫𝐚 ↜♡↝܀⊹🌻❀`, m) //wm, null, [['Menu', '#menu']], m) botones :V

}
    if (/^الاجراس$/i.test(m.text) ) { //sem prefixo
    conn.reply(m.chat, `𝐀𝐮𝐫𝐚 ↜♡↝܀⊹🌻❀

➹――☁️―――☁️――➹

 ☯︎︎ 🛎️ نتائج الأجراس 🛎️ ☯︎︎

⌬┊المركز الأول🥇「」 
• الجائِزة💰┊50K

⌬┊المركز الثاني🥈「」 
• الجائِزة💰┊35K

⌬┊المركز الثالث🥉「」 
• الجائِزة💰┊20K
۞ ⋅‏ ── •﹝✨﹞• ── ⋅ ۞
◈┆ بقية المشاركين 10K 🏅
‏• 
‏• 
‏•  
‏•  
•
♪ ── •﹝✨﹞• ── ⋅ ♪
⌬ ┊ المُقَـدم 🎙️「」
• الجائزة 💰「」
➹――🌻―――🌻――➹
     ⌬┆إدارة • 雲 ┆⌬`, m) //wm, null, [['Menu', '#menu']], m) botones :V

}
    if (/^سؤال مفاجئ$/i.test(m.text) ) { //sem prefixo
    conn.reply(m.chat, `𝐀𝐮𝐫𝐚 ↜♡↝܀⊹🌻❀
➹――🌻―――――🌻――➹

* ⚘ 💢 سؤال مفاجئ  💢 ⚘*

⌬┊السؤال❓「」

⌬┊المستوى 📊「」

⌬┊المقدم🎙️「」
✻ ⋅‏ ── •﹝雲﹞• ── ⋅ ✻
⌬┊النوع 🎭「」

⌬┊موقع الإجابة📍「النقابة」

➹――🌻―――――🌻――➹
⌬┊الجوائز 🏆
⌬┊صعب「」 
⌬┊متوسط「」
⌬┊سهل「」

⌬┊ملاحظة📝  المقدم له نصف الجائزه

➹――🌻―――🌻――➹

    ⌬┆إدارة • 雲 🌻┆⌬*

  ◜*雲┆𝐀𝐮𝐫𝐚 ↜♡↝܀⊹🌻❀‏◞`, m) //wm, null, [['Menu', '#menu']], m) botones :V

}
    if (/^نهاية السؤال$/i.test(m.text) ) { //sem prefixo
    conn.reply(m.chat, `◞❊ 𝐀𝐮𝐫𝐚 ↜♡↝܀⊹🌻❀◜

➹――🌻―――――🌻――➹

 ❁ ⏱️ نهاية السؤال  ⏱️ ❁

⌬┊الإجابة❓「」

⌬┊الفائز 🏅「」

⌬┊الجائِزة 💰「」

⌬┊المقدم 🎙️「」

⌬┊الجائِزة 💰「」


➹――🌻―――――🌻――➹

     ⌬┆إدارة • 雲 🌻┆⌬

  ◜*雲┆𝐀𝐮𝐫𝐚 ↜♡↝܀⊹🌻❀*‏◞`, m) //wm, null, [['Menu', '#menu']], m) botones :V

}
    if (/^الدروع$/i.test(m.text) ) { //sem prefixo
    conn.reply(m.chat, `ᗣ═════✦•✨•✦═════ᗣ*
🌻 إعـلان فـعـالـيـة 🌻

⌑︎ ━═━═✦•✨•✦═━═━ ⌑︎

❖ 🛡 فعالية الدروع 🛡 ❖

┣︎ الشرح📃:
لكل مشارك ٣ دروع في البداية عند الإجابة على سؤال تختار شخص لضرب درعه فيصبح عدد الدروع لديك ٤ ، أما الشخص الذي ضربته ينقص درع واحد منه ، تنتهي عندما يتبقى شخص واحد

┣︎ ملاحظة✨: عندما يصل عدد دروعك الى ٦ لا يمكن زيادته فقط تقدر تنقص من اللي تضرب درعه

 ⌑︎ ━═━═✦•🌻•✦═━═━ ⌑︎

◈══ •「الـجـ💎ـوائـز」• ══◈

✦ المركز الأول🥇:〘〙
✧ المركز الثاني🥈:〘〙
✦ المركز الثالث🥉:〘〙
✧ باقي المشاركين :〘〙

┤المقدم 🎤 :〘〙

 ⌑︎ ━═━═✦•✨•✦═━═━ ⌑︎

⏎التسجيل عند: 〘〙
⏎الوقت⏳:〘〙

⌑︎ ━═━═✦•🧭•✦═━═━ ⌑︎

❀ *مع تحيات إدارة*⤹

‏            𝐀𝐮𝐫𝐚 ↜♡↝܀⊹🌻❀
‏‏
⌑︎ ━═━═✦•✨•✦═━═━ ⌑︎

‏* ᗣ═════✦•✨•✦═════ᗣ`, m) //wm, null, [['Menu', '#menu']], m) botones :V

}
    if (/^مسابقة$/i.test(m.text) ) { //sem prefixo
    conn.reply(m.chat, `‏*◞❊ 𝐀𝐮𝐫𝐚 ↜♡↝܀⊹🌻❀ ◜*

➹――🌻―――――🌻――➹
   ☜༽ ♦️ إعلان مسابقة ♦️༼☞

◞◈ عدد الأسئلة 🔢┆◜
*• صُــوَر  📸*┆♾️
*• كـتابـة 📝*┆♾️
*• ترْتِـيب 🌀*┆
*• تـعـداد 🎲*┆
*• حروف 🔠*┆
۞ ⋅‏ ── •﹝雲﹞• ── ⋅ ۞
◈┆ تَفَاصِيـل المُـسَـابَـقَة 📜
*• الأنِـمِـي 🍂*「」
*• السّاعَة⏱️*「」
*• الـمُـقَـدِّمْ🎙️*「」
➹――🌻―――🌻――➹

     ⌬┆إدارة • 雲┆⌬◞ 𝐀𝐮𝐫𝐚 ↜♡↝܀⊹🌻❀ ◜🌻❀ ◜*`, m) //wm, null, [['Menu', '#menu']], m) botones :V

}
    if (/^مسابقة$/i.test(m.text) ) { //sem prefixo
    conn.reply(m.chat, `‏*◞❊ 𝐀𝐮𝐫𝐚 ↜♡↝܀⊹🌻❀ ◜*

➹――🌻―――――🌻――➹

☜༽ 🏅 نتائج المسابقة 🏅 ༼☞*

‏✽ ⦗🥇⦘ ↫ ** ⁩⇿  «»
‏✽ ⦗🥈⦘ ↫ ** ⁩⇿ «»
‏✽ ⦗🥉⦘ ↫ ** ⁩⇿ «»
۞⋅‏ ── •﹝✨﹞• ── ⋅ ۞

◈┆ بقية المشاركين 🏅
‏•  ** 『』
‏•  ** 『』
‏•  ** 『』
‏•  ** 『』
‏•  ** 『』
۞⋅‏ ── •﹝✨﹞• ── ⋅ ۞

⌬┊ مُقَـدم المُسَابَقة 🎙️**「」
⌬┊ حاسب النـقاط ** 📝 「」
➹――🌻―――🌻――➹

     ⌬┆إدارة • ✨┆⌬

◞❊ 𝐀𝐮𝐫𝐚 ↜♡↝܀⊹🌻❀ ◜🌻❀ ◜*`, m) //wm, null, [['Menu', '#menu']], m) botones :V

}


return !0 }
export default handler
